UPDATE gis_data 
SET floor_details = '[
  {"ΟΡΟΦΟΣ":"-01","ΔΙΑΜΕΡΙΣΜΑΤΑ":1,"ΚΑΤΑΣΤΗΜΑΤΑ":0,"FB ΠΕΛΑΤΗ":"","ΑΡΙΘΜΗΣΗ ΧΩΡΟΥ ΠΕΛΑΤΗ":"","GIS ID":"","FB01":1,"FB01 TYPE":"FB 4 PORTS","FB02":1,"FB02 TYPE":"FB 4 PORTS","FB03":"","FB03 TYPE":"","FB04":"","FB04 TYPE":""},
  {"ΟΡΟΦΟΣ":"+00","ΔΙΑΜΕΡΙΣΜΑΤΑ":3,"ΚΑΤΑΣΤΗΜΑΤΑ":0,"FB ΠΕΛΑΤΗ":"FB(+00).1","ΑΡΙΘΜΗΣΗ ΧΩΡΟΥ ΠΕΛΑΤΗ":"ΙΣ1","GIS ID":"","FB01":1,"FB01 TYPE":"FB 12 PORTS","FB02":"","FB02 TYPE":"","FB03":"","FB03 TYPE":"","FB04":"","FB04 TYPE":""},
  {"ΟΡΟΦΟΣ":"+01","ΔΙΑΜΕΡΙΣΜΑΤΑ":2,"ΚΑΤΑΣΤΗΜΑΤΑ":0,"FB ΠΕΛΑΤΗ":"","ΑΡΙΘΜΗΣΗ ΧΩΡΟΥ ΠΕΛΑΤΗ":"","GIS ID":"","FB01":2,"FB01 TYPE":"FB 4 PORTS","FB02":"","FB02 TYPE":"","FB03":"","FB03 TYPE":"","FB04":"","FB04 TYPE":""},
  {"ΟΡΟΦΟΣ":"+02","ΔΙΑΜΕΡΙΣΜΑΤΑ":2,"ΚΑΤΑΣΤΗΜΑΤΑ":0,"FB ΠΕΛΑΤΗ":"","ΑΡΙΘΜΗΣΗ ΧΩΡΟΥ ΠΕΛΑΤΗ":"","GIS ID":"","FB01":2,"FB01 TYPE":"FB 4 PORTS","FB02":"","FB02 TYPE":"","FB03":"","FB03 TYPE":"","FB04":"","FB04 TYPE":""},
  {"ΟΡΟΦΟΣ":"+03","ΔΙΑΜΕΡΙΣΜΑΤΑ":1,"ΚΑΤΑΣΤΗΜΑΤΑ":0,"FB ΠΕΛΑΤΗ":"","ΑΡΙΘΜΗΣΗ ΧΩΡΟΥ ΠΕΛΑΤΗ":"","GIS ID":"","FB01":1,"FB01 TYPE":"FB 4 PORTS","FB02":"","FB02 TYPE":"","FB03":"","FB03 TYPE":"","FB04":"","FB04 TYPE":""}
]'::jsonb,
updated_at = now()
WHERE id = '12f07b3d-d1ef-45a4-ad82-746f41ec02a9';